In [1]:
# 导入相关库
import numpy as np
import pandas as pd

In [3]:
index = pd.Index(data=["Tom", "Bob", "Mary", "James", "Andy", "Alice"])

data = {
    "age": [18, 40, 28, 20, 30, 35],
    "income": [1000, 4500 , 1800, 1800, 3000, np.nan],
}

df = pd.DataFrame(data=data, index=index)
df

       age  income
Tom     18  1000.0
Bob     40  4500.0
Mary    28  1800.0
James   20  1800.0
Andy    30  3000.0
Alice   35     NaN

In [4]:
df.age.cov(df.income)

11320.0

In [5]:
# 计算相关性
df.age.corr(df.income)

0.944165089513402

In [6]:
data = {
    "turnover": [12000, 18000, np.nan, 12000, 9000, 16000, 18000],
    "date": pd.date_range("2018-07-01", periods=7)
}

df2 = pd.DataFrame(data=data)
df2

   turnover       date
0   12000.0 2018-07-01
1   18000.0 2018-07-02
2       NaN 2018-07-03
3   12000.0 2018-07-04
4    9000.0 2018-07-05
5   16000.0 2018-07-06
6   18000.0 2018-07-07

In [7]:
df2.rolling(window=2, on="date").sum()

   turnover       date
0       NaN 2018-07-01
1   30000.0 2018-07-02
2       NaN 2018-07-03
3       NaN 2018-07-04
4   21000.0 2018-07-05
5   25000.0 2018-07-06
6   34000.0 2018-07-07

In [8]:
df2.rolling(window=2, on="date", min_periods=1).sum()

   turnover       date
0   12000.0 2018-07-01
1   30000.0 2018-07-02
2   18000.0 2018-07-03
3   12000.0 2018-07-04
4   21000.0 2018-07-05
5   25000.0 2018-07-06
6   34000.0 2018-07-07

In [9]:
df2.rolling(window=len(df2), on="date", min_periods=1).sum()

   turnover       date
0   12000.0 2018-07-01
1   30000.0 2018-07-02
2   30000.0 2018-07-03
3   42000.0 2018-07-04
4   51000.0 2018-07-05
5   67000.0 2018-07-06
6   85000.0 2018-07-07

In [10]:
df2.expanding(min_periods=1)["turnover"].sum()

0    12000.0
1    30000.0
2    30000.0
3    42000.0
4    51000.0
5    67000.0
6    85000.0
Name: turnover, dtype: float64

In [11]:
df2.rolling(window=2, min_periods=1)["turnover"].agg([np.sum, np.mean])

       sum     mean
0  12000.0  12000.0
1  30000.0  15000.0
2  18000.0  18000.0
3  12000.0  12000.0
4  21000.0  10500.0
5  25000.0  12500.0
6  34000.0  17000.0

In [13]:
df2.rolling(window=2, min_periods=1)["turnover"].agg({"tur_sum": np.sum, "tur_mean": np.mean})

   tur_sum  tur_mean
0  12000.0   12000.0
1  30000.0   15000.0
2  18000.0   18000.0
3  12000.0   12000.0
4  21000.0   10500.0
5  25000.0   12500.0
6  34000.0   17000.0